import ExcelIcon from "../../redux/uils/icons/iconfinder_excel_272697.png"

export default [
    ["Код ТНВЭД",
        "Полное наименование товара",
        "Товарный знак",
        "Модель / артикул производителя",
        "Модель / артикул производителя_",
        "Вид товара",
        "Цвет",
        "Целевой пол",
        "Размер одежды",
        "Размер одежды_",
        "Состав",
        "Номер Регламента/стандарта",
        "Статус карточки товара в Каталоге",
        "Результат обработки данных в Каталоге"],
    [
        "Tnved",
        "2478",
        "2504",
        "13914",
        "13914",
        "12",
        "36",
        "14013",
        "35",
        "35",
        "2483",
        "13836",
        "status",
        "result"
    ],
    [
        "value",
        "value",
        "value",
        "type",
        "value",
        "value",
        "value",
        "value",
        "type",
        "value",
        "value",
        "value",
        "value",
        "value"
    ],
    [
        "",
        "Текстовое значение",
        "Значение из справочника, Текстовое значение",
        "Тип (из справочника)",
        "Текстовое значение",
        "Текстовое значение",
        "Текстовое значение",
        "Текстовое значение",
        "Тип (из справочника)",
        "Текстовое значение",
        "Текстовое значение",
        "Текстовое значение",
        "Текстовое поле (Черновик или На модерации)",
        "Заполняется автоматически при загрузке в систему"
    ]
    // {
    //     id: 1,
    //     name: "IMPORT_TNVED_6106",
    //     icon: ExcelIcon,
    //     url: 'IMPORT_TNVED_6106',
    //     background: '#833ab4',
    //     disabled: true,
    //     file: {Excel6106}
    // },
    // {
    //     id: 2,
    //     name: "IMPORT_TNVED_6201",
    //     icon: ExcelIcon,
    //     background: '#833ab4',
    //     disabled: true,
    //     url: "IMPORT_TNVED_6201",
    //     file: {Excel6201}
    // },
    // {
    //     id: 3,
    //     name: "IMPORT_TNVED_6202",
    //     icon: ExcelIcon,
    //     background: '#833ab4',
    //     url: 'IMPORT_TNVED_6202',
    //     disabled: true,
    //     file: {Excel6202}
    // },
    // {
    //     id: 4,
    //     name: "IMPORT_TNVED_6302",
    //     icon: ExcelIcon,
    //     background: '#833ab4',
    //     url: 'IMPORT_TNVED_6302',
    //     disabled: true,
    //     file: {Excel6302}
    // },

]


// Код ТНВЭД
// Полное наименование товара
// Товарный знак
// Модель / артикул производителя
// Вид товара
// Цвет
// Целевой пол
// Размер одежды
// Состав
// Номер Регламента/стандарта
// Статус карточки товара в Каталоге
// Результат обработки данных в Каталоге



// Tnved
// 2478
// 2504
// 13914
// 12
// 36
// 14013
// 35
// 2483
// 13836
// status
// result

// "value",
// "value",
// "value",
// "type",
// "value",
// "value",
// "value",
// "value",
// "type",
// "value",
// "value",
// "value",
// "value",
// "value"
